experiments/socialnetwork_singlenode/expected_results/write_qps1000/wrk_warmup.log
Running 30s test @ http://ip-172-31-8-50.us-east-2.compute.internal:8080
  4 threads and 48 connections
  Thread calibration: mean lat.: 4.886ms, rate sampling interval: 11ms
  Thread calibration: mean lat.: 4.860ms, rate sampling interval: 11ms
  Thread calibration: mean lat.: 4.851ms, rate sampling interval: 11ms
  Thread calibration: mean lat.: 4.841ms, rate sampling interval: 11ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     4.77ms  623.18us  18.99ms   70.76%
    Req/Sec   261.84     87.83   600.00     76.90%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    4.72ms
 75.000%    5.14ms
 90.000%    5.55ms
 99.000%    6.30ms
 99.900%    8.45ms
 99.990%   11.81ms
 99.999%   19.01ms
100.000%   19.01ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       3.083     0.000000            1         1.00
       4.027     0.100000         2002         1.11
       4.255     0.200000         4030         1.25
       4.427     0.300000         5996         1.43
       4.579     0.400000         7989         1.67
       4.723     0.500000         9971         2.00
       4.799     0.550000        10994         2.22
       4.875     0.600000        11971         2.50
       4.959     0.650000        12989         2.86
       5.043     0.700000        13956         3.33
       5.139     0.750000        14958         4.00
       5.195     0.775000        15486         4.44
       5.251     0.800000        15965         5.00
       5.311     0.825000        16474         5.71
       5.379     0.850000        16973         6.67
       5.455     0.875000        17444         8.00
       5.499     0.887500        17697         8.89
       5.547     0.900000        17960        10.00
       5.599     0.912500        18200        11.43
       5.651     0.925000        18454        13.33
       5.711     0.937500        18692        16.00
       5.751     0.943750        18816        17.78
       5.795     0.950000        18947        20.00
       5.839     0.956250        19066        22.86
       5.895     0.962500        19194        26.67
       5.955     0.968750        19322        32.00
       5.983     0.971875        19381        35.56
       6.019     0.975000        19441        40.00
       6.059     0.978125        19504        45.71
       6.111     0.981250        19565        53.33
       6.171     0.984375        19625        64.00
       6.199     0.985938        19658        71.11
       6.227     0.987500        19692        80.00
       6.263     0.989062        19719        91.43
       6.319     0.990625        19753       106.67
       6.371     0.992188        19782       128.00
       6.403     0.992969        19798       142.22
       6.443     0.993750        19812       160.00
       6.495     0.994531        19830       182.86
       6.551     0.995313        19844       213.33
       6.607     0.996094        19859       256.00
       6.667     0.996484        19866       284.44
       6.735     0.996875        19874       320.00
       6.855     0.997266        19883       365.71
       6.935     0.997656        19891       426.67
       7.211     0.998047        19898       512.00
       7.283     0.998242        19901       568.89
       7.451     0.998437        19905       640.00
       7.723     0.998633        19909       731.43
       8.063     0.998828        19913       853.33
       8.487     0.999023        19917      1024.00
       8.775     0.999121        19919      1137.78
       9.055     0.999219        19921      1280.00
       9.287     0.999316        19923      1462.86
       9.647     0.999414        19925      1706.67
       9.911     0.999512        19927      2048.00
      10.127     0.999561        19928      2275.56
      10.687     0.999609        19929      2560.00
      10.727     0.999658        19930      2925.71
      11.191     0.999707        19931      3413.33
      11.263     0.999756        19932      4096.00
      11.263     0.999780        19932      4551.11
      11.423     0.999805        19933      5120.00
      11.423     0.999829        19933      5851.43
      11.815     0.999854        19934      6826.67
      11.815     0.999878        19934      8192.00
      11.815     0.999890        19934      9102.22
      12.943     0.999902        19935     10240.00
      12.943     0.999915        19935     11702.86
      12.943     0.999927        19935     13653.33
      12.943     0.999939        19935     16384.00
      12.943     0.999945        19935     18204.44
      19.007     0.999951        19936     20480.00
      19.007     1.000000        19936          inf
#[Mean    =        4.767, StdDeviation   =        0.623]
#[Max     =       18.992, Total count    =        19936]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------

  Latency Distribution (HdrHistogram - Uncorrected Latency (measured without taking delayed starts into account))
 50.000%    3.86ms
 75.000%    4.19ms
 90.000%    4.51ms
 99.000%    5.12ms
 99.900%    7.50ms
 99.990%   11.02ms
 99.999%   16.93ms
100.000%   16.93ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       2.889     0.000000            1         1.00
       3.385     0.100000         2001         1.11
       3.531     0.200000         4000         1.25
       3.647     0.300000         5995         1.43
       3.751     0.400000         7996         1.67
       3.857     0.500000         9981         2.00
       3.911     0.550000        10980         2.22
       3.971     0.600000        11967         2.50
       4.035     0.650000        12963         2.86
       4.107     0.700000        13968         3.33
       4.187     0.750000        14975         4.00
       4.231     0.775000        15468         4.44
       4.279     0.800000        15984         5.00
       4.327     0.825000        16456         5.71
       4.383     0.850000        16957         6.67
       4.443     0.875000        17460         8.00
       4.471     0.887500        17703         8.89
       4.507     0.900000        17961        10.00
       4.543     0.912500        18205        11.43
       4.587     0.925000        18446        13.33
       4.643     0.937500        18707        16.00
       4.667     0.943750        18822        17.78
       4.695     0.950000        18940        20.00
       4.731     0.956250        19069        22.86
       4.771     0.962500        19198        26.67
       4.819     0.968750        19319        32.00
       4.851     0.971875        19384        35.56
       4.879     0.975000        19438        40.00
       4.919     0.978125        19503        45.71
       4.955     0.981250        19570        53.33
       4.995     0.984375        19628        64.00
       5.027     0.985938        19657        71.11
       5.063     0.987500        19690        80.00
       5.095     0.989062        19718        91.43
       5.139     0.990625        19751       106.67
       5.187     0.992188        19783       128.00
       5.231     0.992969        19796       142.22
       5.299     0.993750        19816       160.00
       5.351     0.994531        19828       182.86
       5.415     0.995313        19843       213.33
       5.515     0.996094        19859       256.00
       5.555     0.996484        19866       284.44
       5.643     0.996875        19875       320.00
       5.755     0.997266        19884       365.71
       5.823     0.997656        19890       426.67
       6.031     0.998047        19898       512.00
       6.063     0.998242        19901       568.89
       6.311     0.998437        19905       640.00
       6.843     0.998633        19909       731.43
       7.223     0.998828        19913       853.33
       7.559     0.999023        19917      1024.00
       7.735     0.999121        19919      1137.78
       8.287     0.999219        19921      1280.00
       8.319     0.999316        19923      1462.86
       8.631     0.999414        19925      1706.67
       9.023     0.999512        19927      2048.00
       9.031     0.999561        19928      2275.56
       9.223     0.999609        19929      2560.00
       9.871     0.999658        19930      2925.71
      10.159     0.999707        19931      3413.33
      10.271     0.999756        19932      4096.00
      10.271     0.999780        19932      4551.11
      10.359     0.999805        19933      5120.00
      10.359     0.999829        19933      5851.43
      11.023     0.999854        19934      6826.67
      11.023     0.999878        19934      8192.00
      11.023     0.999890        19934      9102.22
      11.991     0.999902        19935     10240.00
      11.991     0.999915        19935     11702.86
      11.991     0.999927        19935     13653.33
      11.991     0.999939        19935     16384.00
      11.991     0.999945        19935     18204.44
      16.927     0.999951        19936     20480.00
      16.927     1.000000        19936          inf
#[Mean    =        3.917, StdDeviation   =        0.481]
#[Max     =       16.912, Total count    =        19936]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  29992 requests in 30.00s, 6.15MB read
Requests/sec:    999.66
Transfer/sec:    209.89KB